000100160420 SHOWLDA20: PGM
000101160420
000102160420            DCL        VAR(&CHUNK) TYPE(*CHAR) LEN(20)
000103160420
000104160420            RTVDTAARA  DTAARA(*LDA (1 20)) RTNVAR(&CHUNK)
000105160420            SNDPGMMSG  MSG('*LDA positions 1-20 =' *BCAT &CHUNK)
000106160420
000107160420 ENDPGM:    ENDPGM
000108160420
